# WarpingConstant Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..WarpingConstant Property
SpecTypeId Class See Also
---
Warping Constant, in discipline Structural.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId WarpingConstant { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WarpingConstant As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ WarpingConstant {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace